Repository: zwpwjwtz/WiChat-web
Catalog: translations/*.po
Languages: fr_fr, zh_cn

source: Code format is incorrect. Please try again.
fr_fr: Le format de code n'est pas correct. Veuillez réessayer.
zh_cn: 邀请码格式不正确。请重试。

source: This code does not exist.
fr_fr: Ce code n'existe pas.
zh_cn: 邀请码不存在。

source: Sorry, this code has expired.
fr_fr: Désolé, ce code a expiré.
zh_cn: 抱歉，邀请码已过期。

source: Sorry, this code has already been used.
fr_fr: Désolé, ce code a déjà été utilisé.
zh_cn: 抱歉，邀请码已被使用。

source: The invitation code is invalid.
fr_fr: Ce code d'invitation n'est pas valide.
zh_cn: 邀请码无效。

source: ID format is incorrect. Please try again.
fr_fr: Le format d'identification n'est pas correct. Veuillez réessayer.
zh_cn: 账号格式错误，请重试。

source: Password format is incorrect. Please try again.
fr_fr: Le format de mot de passe n'est correct. Veuillez réessayer.
zh_cn: 密码格式错误，请重试。

source: Password do not match.
fr_fr: Les deux mots de passe ne correspondent pas.
zh_cn: 两次输入的密码不一致。

source: Email address is invalid. Please try again.
fr_fr: L'adresse e-mail n'est pas valide. Veuillez réessayer.
zh_cn: 邮箱地址格式有误，请重试。

source: Phone number is invalid. Please try again.
fr_fr: Le numéro de téléphone n'est pas valide. Veuillez réessayer.
zh_cn: 电话号码格式有误，请重试。

source: The length of authentication question must be 1 ~ 30.
fr_fr: La longueur de question d'authentification doit être 1 ~ 30.
zh_cn: 密保问题的长度必须在1～30之间。

source: The length of answer of the authentication question must be 1 ~ 30.
fr_fr: La longueur de résponse de la question d'authentification doit être 1 ~ 30.
zh_cn: 密保问题的答案的长度必须在1～30之间。

source: Please read the General Terms of Use and Disclaimer, then agree with them by clicking the checkbox.
fr_fr: Veuillez lire les Conditions Générales d'Utilisation et la Clause de Non-responsabilité, puis présenter votre accord en cliquant sur la case à cocher.
zh_cn: 请阅读使用条款和免责声明，然后勾选复选框以表示您同意它们。

source: Server error. Please try again later.
fr_fr: Erreur du serveur. Veuillez réessayer ultérieurement.
zh_cn: 服务器错误，请稍后重试。

source: This ID already exists. Please choose another one.
fr_fr: Cet ID existe déjà. Veuillez en choisir un autre.
zh_cn: 账号已存在，请选择其他的账号。

source: Registration failed.
fr_fr: Échec de l'enregistrement.
zh_cn: 注册失败。

source: Please contact website administrator for help.
fr_fr: Veuillez contacter l'administrateur du site pour plus d'information.
zh_cn: 请联系网站管理员以获取帮助。
